# 데이터 입력
storeA <- c(20,21,23,22,26,28,35,35,41,42,43,45,44,45,46,47,47,46,47,58,58,59,60,56,57,57,80)
storeB <- c(5,6,11,13,15,16,20,20,21,23,22,27,27,30,30,32,36,37,37,40,40,43,44,45,51,54,70,600)
storeC <- c(5,5,5,12,10,11,20,20,20,20,20,21,20,30,32,31,31,31,36,40,40,51,61,51,61,61,70)

# 1. 평균을 이용한 데이터 특성 파악
# A식당은 주문 후 평균 44분 정도 후에 음식이 도착한다. 
mean(storeA)

# 2. 중간값을 이용한 데이터 특성 파악
mean(storeB)
# B식당에 이상치가 있으므로 이를 제거 후 평균
mean(storeB[storeB<600])
# 평균은 이상치에 영향을 받음 > 중간 값으로 비교
median(storeA)
median(storeB)
# A식당은 50%가 45분이내에, B식당은 30분이내의 시간이 소요됨을 확인할 수 있음

# 3. 사분위수를 이용한 데이터 특성 파악
# 사분위수는 정렬된 데이터를 사등분한 지점의 값을 표현한 지표
quantile(storeA)
quantile(storeB)
# 25 ~ 75%구간의 값으로 데이터의 밀집도를 파악할 수 있음
# A식당은 75%의 주문이 56.5분, B식당은 40.75분 이내 도착

# 4. 상자그림을 이용한 데이터 특성 파악
# 실제로 데이터를 접할 때는 시각화를 통해 데이터의 전체적인 
# 생김새를 확인하는 방식이 효율적임.
# 600이라는 이상치 값을 확인할 수 있음
boxplot(storeB)
# 이상치 제거 후 상자그림
storeB <- storeB[storeB<600]
boxplot(storeB)
# A식당과 B식당의 상자그림 비교
boxplot(storeA,storeB,names=c("A식당","B식당"))
# A식당의 배달 시간이 B식당보다 더 많이 소요됨을 파악가능
# 그래프의 중간값과 3사분위값을 통해 의미를 도출
# 사분위 수의 특성상 값의 순서를 기준으로 표현하므로
# 사분위 수 사이의 구간 데이터가 어떻게 구성돼 있는지는 확인할 수 없음
